Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_SaveTimerToEEPROM(void)
{
    TimerEEPROMBlock blk;
    memset(&blk, 0, sizeof(blk));
    blk.signature = TIMER_EE_SIGNATURE;
    blk.version   = TIMER_EE_VERSION;
    memcpy(blk.slots, timerSlots, sizeof(timerSlots));
    blk.crc = Timer_CRC16((uint8_t*)&blk,
                          sizeof(blk) - sizeof(uint16_t));
    EEPROM_WriteBuffer(EE_ADDR_TIMER_BLOCK,
                       (uint8_t*)&blk,
                       sizeof(blk));
}
void ModelHandle_LoadTimerFromEEPROM(void)
{
    TimerEEPROMBlock blk;
    EEPROM_ReadBuffer(EE_ADDR_TIMER_BLOCK,(uint8_t*)&blk,sizeof(blk));
    if(blk.signature != TIMER_EE_SIGNATURE) return;
    uint16_t crc = Timer_CRC16((uint8_t*)&blk, sizeof(blk)-2);
    if(blk.crc != crc) return;
    memcpy(timerSlots, blk.slots, sizeof(timerSlots));
}
void Timer_EEPROM_EnsureValid(void)
{
    TimerEEPROMBlock blk;
    EEPROM_ReadBuffer(EE_ADDR_TIMER_BLOCK,(uint8_t*)&blk,sizeof(blk));
    uint16_t crc = Timer_CRC16((uint8_t*)&blk,sizeof(blk)-2);
    if(blk.signature!=TIMER_EE_SIGNATURE || blk.crc!=crc)
    {
        memset(timerSlots,0,sizeof(timerSlots));
        ModelHandle_SaveTimerToEEPROM();
    }
}
static bool is_schedule_allowing_run(void)
{
    if (!timer_any_active_slot())
        return false;
    return true;
}

static uint8_t read_raw_tank_level(void)
{
    uint8_t level = 0;
    if (adcData.voltages[3] < PROBE_THRESHOLD) level = 25;
    if (adcData.voltages[2] < PROBE_THRESHOLD) level = 50;
    if (adcData.voltages[1] < PROBE_THRESHOLD) level = 75;
    if (adcData.voltages[0] < PROBE_THRESHOLD) level = 100;
    return level;
}

static uint8_t get_tank_level_percent(void)
{
    static uint8_t stableLevel = 0;
    static uint8_t candidateLevel = 0;
    static uint32_t changeTime = 0;
    uint32_t now = HAL_GetTick();
    uint8_t rawLevel = read_raw_tank_level();
    if (rawLevel != stableLevel)
    {
        if (rawLevel != candidateLevel)
        {
            candidateLevel = rawLevel;
            changeTime = now;
        }
        if ((now - changeTime) >= SENSOR_STABLE_TIME_MS)
        {
            stableLevel = candidateLevel;
        }
    }
    return stableLevel;
}

static bool isTankFull(void)
{
    return (get_tank_level_percent() == 100);
}

void ModelHandle_StartRestart(void)
{
    if (isTankFull())
        return;
    backup_current_mode();
    clear_all_modes();
    restartActive = true;
    restartState  = RESTART_RUN_CONTINUOUS;
    restartDeadline = 0;
    motorOwner = MOTOR_OWNER_RESTART;
    senseMaxRunReached = false;
    start_motor();
}

void ModelHandle_TimerRecalculateNow(void)
{
    if (!timerActive) return;
    ModelHandle_ProcessTimerSlots();
}
void ModelHandle_ProcessDryRun(void)
{
    ModelHandle_SoftDryRunHandler();
}
uint8_t ModelHandle_GetPowerRestoreMode(void)
{
    return powerRestoreMode;
}
void ModelHandle_SetPowerRestoreMode(uint8_t mode)
{
    if (mode > 2) mode = 0;
    powerRestoreMode = mode;
    ModelHandle_SaveModeState();
}
void ModelHandle_ToggleManual(void)
{
    if (!manualActive)
    {
        autoActive = false;
        autoState  = AUTO_IDLE;
        auto_retry_count = 0;
        clear_all_modes();
        manualActive = true;
        motorOwner   = MOTOR_OWNER_MANUAL;
    }
    else
    {
        manualActive = false;
        motorOwner   = MOTOR_OWNER_NONE;
        stop_motor();
    }
    ModelHandle_SaveModeState();
}
void ModelHandle_ManualToggleMotor(void)
{
    if (!manualActive)
        return;
    if (Motor_GetStatus())
        stop_motor();
    else
        start_motor();
}

void ModelHandle_SetDryRunAndRetry(uint32_t retry_gap_sec,
                                   uint16_t dry_time_sec)
{
    if (retry_gap_sec < 10)
        retry_gap_sec = 10;
    if (dry_time_sec < 10)
        dry_time_sec = 10;
    sys.gap_time_s      = retry_gap_sec;
    sys.dry_run_time_s  = dry_time_sec;
    ModelHandle_SaveSettingsToEEPROM();
}
void ModelHandle_Button3_SinglePress(void)
{
    if (!timerActive)
    {
        if (!manualActive)
            clear_all_modes();
        timerActive = true;
        motorOwner  = MOTOR_OWNER_TIMER;
    }
    else
    {
        timerActive = false;
        stop_motor();
    }
    ModelHandle_SaveModeState();
}
void ModelHandle_StopAllModesAndMotor(void)
{
    clear_all_modes();
    stop_motor();
    ModelHandle_SaveModeState();
}
void ModelHandle_FactoryReset(void)
{
    sys.gap_time_s  = 0;
    sys.retry_count = 0;
    sys.uv_limit    = 190;
    sys.ov_limit    = 270;
    sys.overload    = 0.0f;
    sys.underload   = 0.0f;
    sys.maxrun_min  = 300;
    ModelHandle_SaveSettingsToEEPROM();
}
void ModelHandle_StartTimerNearestSlot(void)
{
    ModelHandle_ProcessTimerSlots();
}

static inline void Buzzer_SetPin(bool on)
{
    HAL_GPIO_WritePin(LED5_GPIO_Port, LED5_Pin,
                      on ? GPIO_PIN_SET : GPIO_PIN_RESET);
}
static void Buzzer_StartEvent(BuzzerEvent ev)
{
    activeBuzzEvent = ev;
    buzzerAlertUntil = HAL_GetTick() + 30000UL;
}

static void Buzzer_Update(void)
{
    uint32_t now = HAL_GetTick();
    static bool buzzerState = false;
    bool newState = false;
    bool motorOn = Motor_GetStatus();
    if (buzzerSettings.pumpOnSound && motorOn)
    {
        newState = true;
    }
    else if (buzzerSettings.tankFullSound &&
             activeBuzzEvent == BUZZ_TANK_FULL &&
             now < buzzerAlertUntil)
    {
        newState = true;
    }
    else if (buzzerSettings.tankEmptySound &&
             activeBuzzEvent == BUZZ_TANK_EMPTY &&
             now < buzzerAlertUntil)
    {
        newState = ((now % 400UL) < 100UL);
    }
    else
    {
        activeBuzzEvent = BUZZ_NONE;
    }
    if (newState != buzzerState)
    {
        buzzerState = newState;
        Buzzer_SetPin(buzzerState);
    }
}

static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}
void ModelHandle_SetProtectionSettings(uint32_t retry_gap_sec,
                                        uint16_t dry_time_sec,
                                        uint8_t  dry_enable)
{
    if (retry_gap_sec < 10)
        retry_gap_sec = 10;
    if (dry_time_sec < 10)
        dry_time_sec = 10;
    sys.gap_time_s     = retry_gap_sec;
    sys.dry_run_time_s = dry_time_sec;
    sys.dry_run_enable = dry_enable ? 1 : 0;
    ModelHandle_SaveSettingsToEEPROM();
}
static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
    countdownMode   = false;
}

void ModelHandle_OnPowerUp(void)
{
    powerOnMs = HAL_GetTick();
    autoBootIgnoreUntil = powerOnMs + 15000UL;
    bootStartBlockUntil = powerOnMs + MOTOR_START_DELAY_MS;
    autoDeadline = 0;
    if (timer_any_active_slot())
    {
        timerActive = true;
        timerState  = TIMER_STATE_ON;
        timerStateDeadline = 0;
        motorOwner  = MOTOR_OWNER_TIMER;
    }
    if (autoActive)
    {
        uint8_t level = get_tank_level_percent();
        if (level <= AUTO_START_LEVEL_PERCENT)
        {
            motorOwner = MOTOR_OWNER_AUTO;
            autoState  = AUTO_ON_WAIT;
            uint32_t gapSec = (sys.gap_time_s == 0) ? 120 : sys.gap_time_s;
            autoDeadline = HAL_GetTick() + (gapSec * 1000UL);
        }
        else
        {
            autoActive = false;
            motorOwner = MOTOR_OWNER_NONE;
        }
    }
}

static inline bool Motor_IsRelayOn(void)
{
    return HAL_GPIO_ReadPin(Relay1_GPIO_Port, Relay1_Pin) == GPIO_PIN_SET;
}
static bool Motor_StartAllowed(void)
{
    return true;
}

